Revit 2024 API
ParameterTypeId.DpartCanHostRebar Property
 "Can host rebar"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DpartCanHostRebar { get; }
Visual Basic
Public Shared ReadOnly Property DpartCanHostRebar As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DpartCanHostRebar {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace